[{"author": null, "title": "Queen Elizabeth makes first appearance since Harry and Meghan interview", "date": "2021-03-12T22:19:12Z", "content": "LONDON  – Britain’s Queen Elizabeth has made her first appearance since a tell-all interview by grandson Prince Harry and his wife Meghan rocked the monarchy, but made no reference to the crisis it had caused her family.\nDuring the Oprah Winfrey interview, Meghan said a member of the royal family had made a racist comment and Harry criticised his relatives for how they dealt with press treatment of his wife, with the fallout dominating the British media since it aired last Sunday.\nOn Thursday, Harry’s elder brother Prince William told reporters “we’re very much not a racist family”, the day after the 94-year-old monarch herself issued a statement on behalf of the royals in which she said they were saddened by how challenging the couple had found the last few years.\nThe Sun newspaper, citing an unnamed source, said Harry’s father, heir-to-the-throne Prince Charles, had wanted to issue a point by point rebuttal, but the royal family had decided not to get involved in a ‘tit for tat’ battle.\nIn a video call with scientists and schoolchildren to mark British Science Week, the queen did not refer to the interview at all, the royals’ usual approach to what they have said was a private, family matter.\nInstead she discussed the latest updates from NASA’s Mars Perseverance mission, as well as the discovery of a rare meteorite which landed in Gloucestershire, western England last month, the first to be recovered in the United Kingdom for 30 years.\n“I’m glad it didn’t hit anyone,” the queen quipped during the “virtual showcase”, which took place on Wednesday although details were only released by Buckingham Palace on Friday.\nWhen told by space scientist and broadcaster Maggie Aderin-Pocock that she had been inspired to follow her career by the exploits of Russian Yuri Gagarin, the first human in space in 1961, Elizabeth, who has reigned for 69 years, recounted that she had met him shortly afterwards at Buckingham Palace.\nAsked what he was like, she replied: “Russian, he didn’t speak English. He was fascinating and I suppose being the first one, it was particularly fascinating.”\n"}, {"author": "oestrada", "title": "Can Italy’s Dante have justice, 700 years after his death?", "date": "2021-03-12T09:12:45Z", "content": "Dante’s “Divine Comedy,” considered one of the world’s greatest literary works, came to light after a miscarriage of justice which Italian legal experts now want to correct — some seven centuries on.\nThe man whom Italians call the “Supreme Poet” was exiled from his native Florence in January 1302, after finding himself on the losing side of a feud between the city’s “White” and “Black” political factions.\n“Our objective is to assess, in the light of new evidence that may emerge, if these (three) verdicts (against Dante) could be the subject of a retrial, or ideally be quashed,” criminal lawyer Alessandro Traversi told AFP.\nTo do that, Traversi has invited fellow lawyers, senior judges, and prosecutors — plus the descendants of both Dante and the judge who banished him from Florence — to reopen the case at a May 21 conference.\nCount Sperello di Serego Alighieri, an astronomer with a direct bloodline to Dante, will take part alongside the scion of Cante de Gabrielli, the judge who exiled the poet.\n“I find it interesting to review this affair,” said the judge’s descendant, Antoine de Gabrielli.\nBut he added that he would not seek to uphold his ancestor’s position that Dante was guilty.\n“I’m not going to fight,” the Frenchman told AFP.\nEven if a full-blown retrial is unlikely to materialize, given all the practical and legal issues, Traversi stressed the value of a symbolic gesture of reparation towards Dante, who “legally speaking, for the City of Florence is still a person with a criminal record”.\nAs well as a poet, Dante was a politician who served as one of Florence’s nine elected rulers, or priors, for a regular two-month term in 1300.\nIt was this post that landed him in trouble.\nWhen the “Blacks” faction retook Florence in 1301 with the help of Charles of Valois, brother of King Philip IV of France, and the support of Pope Boniface VIII, Dante, and other “White” priors were tried in absentia.\nIn January 1302, Cante de Gabrielli found them guilty of corruption and political patronage, gave them three days to pay a huge fine, and banned them from public office.\nDante and the others were also stripped of their assets.\nTwo months later, de Gabrielli sentenced them to be burnt at the stake if they tried to return to Florence.\nIn 1315, after Dante refused the terms of an amnesty, another judge changed the sentence to death by beheading, also for the poet’s sons.\nDante survived, roaming from one Italian city to another.\nRelatively little is known about his life, but he is believed to have completed the “Divine Comedy”, an imaginary journey through hell, purgatory, and heaven, shortly before his death in 1321.\nExile is a major theme in the book, which also offered Dante the chance for some personal score-settling: in it, he made sure to find a place in hell for Boniface VIII and his other earthly foes.\nExperts have long agreed that Dante was the victim of biased judges.\nBut Alessandro Barbero, Italy’s most famous medieval historian, recently suggested that certain charges against him may have had some substance.\nDante definitely did not take bribes, but it is “not exactly impossible” to imagine he exploited his role in office to favor his political allies, Barbero wrote in a recent biography.\nTraversi hopes to set the record straight on this — and dispel any doubts about Dante’s rectitude.\nHis conference will be one of several events honoring the poet on the 700th anniversary of his death — most set to be celebrated in a rather subdued fashion due to coronavirus restrictions.\n“We hope to do it in person, but we are ready to do it remotely if necessary,” the Florentine lawyer said.\nMargherita Cassano, a judge from the Court of Cassation, Italy’s supreme court, will draft a final report from the conference, and all deliberations will be published in a book, Traversi said.\nHowever, Serego Alighieri — the descendant who not only carries Dante’s name but also shares with him the distinctive family trait of an aquiline nose — noted it all came a little late.\n“Dante was convicted, he went into exile, he was exiled all his life, he never returned to Florence,” he told AFP.\n“Anything that can be done for him (today) will not change any of that.”\n"}, {"author": "vcatibog", "title": "5 Best #NotYourOrdinaryLumpia recipes to try this summer", "date": "2021-03-12T06:11:57Z", "content": "Manila, Philippines – March 10, 2021 – In practically every Filipino get-together, there is lumpia, a spring roll made of paper-thin wrapper, stuffed with various savory or sweet fillings. This well-loved dish has recently gone from table to TikTok, thanks to food creators on the app who have been sharing their own lumpia recipes with a twist. A quick look at the trending hashtag #NotYourOrdinaryLumpia will show you how these creators have taken the classic Filipino favorite to the next level.\nNow that summer has arrived, it is a great time to discover some cool and unique ways to prepare lumpia. Check out these #NotYourOrdinaryLumpia dishes from TikTok that are perfect for the hot weather.\nMilk tea lovers are sure to enjoy this cream and boba-filled version of lumpia, which is finished off with a brown sugar sesame glaze.\nHalo-halo is a summer staple in the Philippines. This unique lumpia, which uses classic halo-halo toppings as filling, is best served with a scoop of ice cream on top.\nThis lumpia is filled with mixed fruits that are typically used for fruit salad. You can drizzle the creamy dressing on top before you eat or serve it on the side as a dip.\n"}]